Revert "feat: enhance architecture diagrams and update commit flow sequence in README"
This reverts commit 2cbb225770b909fa69f93e216b4dcd9348771bdb.
